title: VMaNGOS Wrong Password
id: b394acc1-6ac5-4785-b37f-c25cf1020fc4
status: experimental
description: Detecta intentos de login con password incorrecta contra el realmd de VMaNGOS, posible fuerza bruta a cuentas del juego
references:
    - https://attack.mitre.org/techniques/T1110/001/
author: Jose Argento
date: 2026-07-05
logsource:
    product: vmangos
    service: realmd
detection:
    keywords:
        - 'tried to login with wrong password'
    condition: keywords
falsepositives:
    - Jugador legitimo que tipea mal su contrasena
level: medium
tags:
    - attack.credential_access
    - attack.t1110.001
